/* REXX    POPINDX    Populate the #INDEX member from another dataset
           Use '(routine name)  ?' for HELP-text.

           Written by Frank Clarke  rexxhead@yahoo.com  20020425

     Impact Analysis
.    SYSEXEC   TRAPOUT

     Modification History
     20230415 fxc adjust HELP;
     20230806 fxc chg SYSPROC to SYSEXEC in Impact Analysis;
     20240308 fxc chg dollar-sign to @ everywhere;
     20240415 fxc DUMP_QUEUE quiet;

*/ arg argline
address TSO                            /* REXXSKEL ver.20010802      */
arg parms "((" opts

signal on syntax
signal on novalue

call TOOLKIT_INIT                      /* conventional start-up     -*/
rc     = trace(tv)
info   = parms                         /* to enable parsing          */

call A_INIT                            /*                           -*/
call B_READ_OTHER                      /*                           -*/
call C_FIX_INDEX                       /*                           -*/

if \sw.nested then call DUMP_QUEUE 'quiet' /*                       -*/
exit                                   /*@ POPINDX                   */
/*
.  ----------------------------------------------------------------- */
A_INIT:                                /*@                           */
   if branch then call BRANCH
   address TSO

   call AK_KEYWDS                      /*                           -*/
   parse var info  mainds  info
   if mainds = "" then do
      helpmsg = "The primary dataset name is REQUIRED. "
      call HELP                        /* ...and don't come back     */
      end
   else do                             /* edit dsn                   */
      if Left(mainds,1) = "'" then do  /* quoted                     */
         mainds = Strip(mainds,,"'")
         end                           /* quoted                     */
      else do                          /* unquoted                   */
         mainds = Userid()"."mainds
         end                           /* unquoted                   */
      mainds = "'"mainds"(#INDEX)'"
      end

   parse value ""    with ,
         type.   desc.   ,
         .

return                                 /*@ A_INIT                    */
/*
.  ----------------------------------------------------------------- */
AK_KEYWDS:                             /*@                           */
   if branch then call BRANCH
   address TSO

   otherds   = KEYWD("FROM")
   if otherds = "" then do
      helpmsg = "FROM is a required parameter. "
      call HELP                        /* ...and don't come back     */
      end
   else do                             /* edit dsn                   */
      if Left(otherds,1) = "'" then do /* quoted                     */
         otherds = Strip(otherds,,"'")
         end                           /* quoted                     */
      else do                          /* unquoted                   */
         otherds = Userid()"."otherds
         end                           /* unquoted                   */
      otherds = "'"otherds"(#INDEX)'"
      end

   sw.0all   = SWITCH("ALL")           /* all? or just '(new)'?      */

return                                 /*@ AK_KEYWDS                 */
/*
.  ----------------------------------------------------------------- */
B_READ_OTHER:                          /*@                           */
   b_tv = trace()                      /* what setting at entry ?    */
   if branch then call BRANCH
   address TSO

   "NEWSTACK"
   "ALLOC FI(@TMP) DA("otherds") SHR REU"
   "EXECIO * DISKR @TMP (FINIS"

   do queued()
      parse pull line
      if Left(Strip(line),1) = "=" then leave
   end                                 /* queued                     */
                                     rc = Trace("O"); rc = trace(b_tv)
   do queued()
      parse pull name type desc
      if name = "" then iterate        /* empty line                 */
      if type = "(new)" then iterate   /* unset line                 */
      type.name  = type
      desc.name  = desc
   end                                 /* queued                     */

   "DELSTACK"

return                                 /*@ B_READ_OTHER              */
/*
.  ----------------------------------------------------------------- */
C_FIX_INDEX:                           /*@                           */
   c_tv = trace()                      /* what setting at entry ?    */
   if branch then call BRANCH
   address TSO

   "NEWSTACK"
   "ALLOC FI(@TMP) DA("mainds") SHR REU"
   "EXECIO * DISKR @TMP (FINIS"

   queue 'ffff'x                       /* end-of-queue marker        */
   do queued()
      parse pull line
      queue line
      if Left(Strip(line),1) = "=" then leave
      if line = 'ffff'x then do        /* no header!                 */
         "DELSTACK"
         helpmsg = "Dataset" mainds "does not have a proper #INDEX. ",
                   "You may have to run MEMIDX against it."
         call HELP                     /* ...and don't come back     */
   end                                 /* queued                     */
                                     rc = Trace("O"); rc = trace(c_tv)
   do queued()
      parse pull line
      if line = 'ffff'x then leave     /* end-of-queue               */
      parse var  line  name type desc
      if line = "" then queue " "      /* empty line                 */
      else,
      if type <> "(new)" &,
         sw.0all = 0 then queue line   /* don't do this one          */
      else do
         if type.name = "" then,
            ln = line
         else do                       /* known name                 */
            ln = " "Left(name,10)""Left(type.name,12)""Strip(desc.name)
            if monitor then say ln
            end
         queue ln
         end
   end                                 /* queued                     */

   if noupdt = 0 then,                 /* OK to write                */
      "EXECIO" queued() "DISKW @TMP (FINIS"
   "FREE  FI(@TMP)"
   "DELSTACK"

return                                 /*@ C_FIX_INDEX               */
/*
.  ----------------------------------------------------------------- */
LOCAL_PREINIT:                         /*@ customize opts            */
   address TSO


return                                 /*@ LOCAL_PREINIT             */
/*   subroutines below LOCAL_PREINIT are not selected by SHOWFLOW    */
/*
.  ----------------------------------------------------------------- */
HELP:                                  /*@                           */
address TSO;"CLEAR"
if helpmsg <> "" then say helpmsg; say ""
ex_nam = Left(exec_name,8)             /* predictable size           */

say "  "ex_nam"      Populate the #INDEX member from another dataset.          "
say "                                                                          "
say "  Syntax:   "ex_nam"  mainds                                              "
say "                      FROM otherds                                        "
say "                 ((   ALL                                                 "
say "                                                                          "
say "            mainds    identifies the dataset whose #INDEX member is to be "
say "                      updated.                                            "
say "                                                                          "
say "            otherds   identifies the dataset whose #INDEX will provide the"
say "                      data to use for the update.                         "
say "                                                                          "
say "            ALL       signals that all index lines for which updating data"
say "                      exists are to be updated.  The default is to update "
say "                      only those lines identified as '(new)'.             "
say "                                                                          "
"NEWSTACK"; pull ; "CLEAR" ; "DELSTACK"
say "   Debugging tools provided include:                                      "
say "                                                                          "
say "        MONITOR   displays key information throughout processing.         "
say "                                                                          "
say "        NOUPDT    by-pass all update logic.                               "
say "                                                                          "
say "        BRANCH    show all paragraph entries.                             "
say "                                                                          "
say "        TRACE tv  will use value following TRACE to place the execution in"
say "                  REXX TRACE Mode.                                        "
say "                                                                          "
say "                                                                          "
say "   Debugging tools can be accessed in the following manner:               "
say "                                                                          "
say "        TSO "ex_nam"  parameters     ((  debug-options                    "
say "                                                                          "
say "   For example                                                            "
say "                                                                          "
say "        TSO "ex_nam"  (( MONITOR TRACE ?R                                 "
if sysvar("SYSISPF") = "ACTIVE" then,
   address ISPEXEC "CONTROL DISPLAY REFRESH"
exit                                   /*@ HELP                      */
/*
.  ----------------------------------------------------------------- */
BRANCH: Procedure expose,              /*@                           */
        sigl exec_name
   rc = trace("O")                     /* we do not want to see this */
   arg brparm .

   origin = sigl                       /* where was I called from ?  */
   do currln = origin to 1 by -1       /* inch backward to label     */
      if Right(Word(Sourceline(currln),1),1) = ":" then do
         parse value sourceline(currln) with pgfname ":" .  /* Label */
         leave ; end                   /*                name        */
   end                                 /* currln                     */

   select
      when brparm = "NAME" then return(pgfname) /* Return full name  */
      when brparm = "ID"      then do           /* wants the prefix  */
         parse var pgfname pgfpref "_" .        /* get the prefix    */
         return(pgfpref)
         end                           /* brparm = "ID"              */
      otherwise
         say left(sigl,6) left(pgfname,40) exec_name "Time:" time("L")
   end                                 /* select                     */

return                                 /*@ BRANCH                    */
/*
.  ----------------------------------------------------------------- */
DUMP_QUEUE:                            /*@ Take whatever is in stack */
   rc = trace("O")                     /*  and write to the screen   */
   address TSO
   arg mode .

   "QSTACK"                            /* how many stacks?           */
   stk2dump    = rc - tk_init_stacks   /* remaining stacks           */
   if stk2dump = 0 & queued() = 0 then return
   if mode <> "QUIET" then,
   say "Total Stacks" rc ,             /* rc = #of stacks            */
    "   Begin Stacks" tk_init_stacks , /* Stacks present at start    */
    "   Excess Stacks to dump" stk2dump

   do dd = rc to tk_init_stacks by -1  /* empty each one.            */
      if mode <> "QUIET" then,
      say "Processing Stack #" dd "   Total Lines:" queued()
      do queued();parse pull line;say line;end /* pump to the screen */
      "DELSTACK"                       /* remove stack               */
   end                                 /* dd = 1 to rc               */

return                                 /*@ DUMP_QUEUE                */
/*
.  ----------------------------------------------------------------- */
KEYWD: Procedure expose info           /*@ hide all vars, except info*/
   arg kw
   kw_pos = wordpos(kw,info)           /* find where it is, maybe    */
   if kw_pos = 0 then return ""        /* send back a null, not found*/
   kw_val = word(info,kw_pos+1)        /* get the next word          */
   info   = Delword(info,kw_pos,2)     /* remove both                */
return kw_val                          /*@ KEYWD                     */
/*
.  ----------------------------------------------------------------- */
KEYPHRS: Procedure expose,             /*@                           */
         info helpmsg exec_name        /*  except these three        */
   arg kp
   wp    = wordpos(kp,info)            /* where is it?               */
   if wp = 0 then return ""            /* not found                  */
   front = subword(info,1,wp-1)        /* everything before kp       */
   back  = subword(info,wp+1)          /* everything after kp        */
   parse var back dlm back             /* 1st token must be 2 bytes  */
   if length(dlm) <> 2 then            /* Must be two bytes          */
      helpmsg = helpmsg,
         "Invalid length for delimiter("dlm") with KEYPHRS("kp")"
   if wordpos(dlm,back) = 0 then       /* search for ending delimiter*/
      helpmsg = helpmsg,
         "No matching second delimiter("dlm") with KEYPHRS("kp")"
   if helpmsg <> "" then call HELP     /* Something is wrong         */
   parse var back kpval (dlm) back     /* get everything b/w delim   */
   info =  front back                  /* restore remainder          */
return Strip(kpval)                    /*@ KEYPHRS                   */
/*
.  ----------------------------------------------------------------- */
NOVALUE:                               /*@                           */
   say exec_name "raised NOVALUE at line" sigl
   say " "
   say "The referenced variable is" condition("D")
   say " "
   zsigl = sigl
   signal SHOW_SOURCE                  /*@ NOVALUE                   */
/*
.  ----------------------------------------------------------------- */
SHOW_SOURCE:                           /*@                           */
   call DUMP_QUEUE                     /* Spill contents of stacks  -*/
   if sourceline() <> "0" then         /* to screen                  */
      say sourceline(zsigl)
   rc =  trace("?R")
   nop
   exit                                /*@ SHOW_SOURCE               */
/*
.  ----------------------------------------------------------------- */
SS: Procedure                          /*@ Show Source               */
   arg  ssbeg  ssend  .
   if ssend = "" then ssend = 10
   if \datatype(ssbeg,"W") | \datatype(ssend,"W") then return
   ssend = ssbeg + ssend
   do ssii = ssbeg to ssend ; say Strip(sourceline(ssii),'T') ; end
return                                 /*@ SS                        */
/*
.  ----------------------------------------------------------------- */
SWITCH: Procedure expose info          /*@                           */
   arg kw
   sw_val = Wordpos(kw,info) > 0       /* exists = 1; not found = 0  */
   if sw_val then                      /* exists                     */
      info = Delword(info,Wordpos(kw,info),1) /* remove it           */
return sw_val                          /*@ SWITCH                    */
/*
.  ----------------------------------------------------------------- */
SYNTAX:                                /*@                           */
   errormsg = exec_name "encountered REXX error" rc "in line" sigl":",
                        errortext(rc)
   say errormsg
   zsigl = sigl
   signal SHOW_SOURCE                  /*@ SYNTAX                    */
/*
   Can call TRAPOUT.
.  ----------------------------------------------------------------- */
TOOLKIT_INIT:                          /*@                           */
   address TSO
   info = Strip(opts,"T",")")          /* clip trailing paren        */

   parse source  sys_id  how_invokt  exec_name  DD_nm  DS_nm,
                     as_invokt  cmd_env  addr_spc  usr_tokn

   parse value "" with  tv  helpmsg  .
   parse value 0   "ISR00000  YES"     "Error-Press PF1"    with,
               sw.  zerrhm    zerralrm  zerrsm

   if SWITCH("TRAPOUT") then do
      "TRAPOUT" exec_name parms "(( TRACE R" info
      exit
      end                              /* trapout                    */

   if Word(parms,1) = "?" then call HELP /* I won't be back          */

   "QSTACK" ; tk_init_stacks = rc      /* How many stacks?           */

   parse value SWITCH("BRANCH") SWITCH("MONITOR") SWITCH("NOUPDT") with,
               branch           monitor           noupdt    .

   parse value mvsvar("SYSNAME") sysvar("SYSNODE") with,
               #tk_cpu           node          .

   sw.nested    = sysvar("SYSNEST") = "YES"
   sw.batch     = sysvar("SYSENV")  = "BACK"
   sw.inispf    = sysvar("SYSISPF") = "ACTIVE"

   parse value KEYWD("TRACE")  "N"    with   tv  .
   tk_globalvars = "exec_name  tv  helpmsg  sw.  zerrhm  zerralrm ",
                   "zerrsm  zerrlm  tk_init_stacks  branch  monitor ",
                   "noupdt"

   call LOCAL_PREINIT                  /* for more opts             -*/

return                                 /*@ TOOLKIT_INIT              */
